{
  "topics": [
    {
      "name": "HTML",
      "id": "html",
      "description": "Dictates the structure and contents of every web page on the internet. Lets you put text and images on a web page; if you want to make a web site, start here.",
      "resources": [
        {
          "name": "HTML Dog",
          "url": "http://www.htmldog.com/guides/html",
          "description": "Walks you through learning all the different HTML tags one at a time. Beginner, intermediate, and advanced tracks. A great place to start!"
        },
        {
          "name": "Mozilla Developer Network",
          "url": "https://developer.mozilla.org/en-US/docs/Web/HTML",
          "description": "Extensive reference by the organization behind Firefox. If you need any element of HTML explained to you very clearly or in detail, look here."
        },
        {
          "name": "Dive Into HTML5",
          "url": "http://diveintohtml5.info",
          "description": "Clearly explains hand-picked features of the latest and greatest version of HTML, HTML5, and how HTML5 compares to earlier HTML standards."
        },
        {
          "name": "HTML5 Rocks",
          "url": "http://diveintohtml5.info",
          "description": "Promotes innovations and describes best practices in HTML5. Once you've mastered the basics, check in here regularly."
        },
        {
          "name": "HTML5 Boilerplate",
          "url": "http://html5boilerplate.com",
          "description": "The web's most popular front-end template. Starting a new project? Hit the ground running with HTML5 Boilerplate."
        },
        {
          "name": "Codecademy Web Fundamentals Track",
          "url": "http://www.codecademy.com/tracks/web",
          "description": "Interactive, online tutorial to learn to HTML and CSS. No experience necessary, and great for learning HTML and CSS together."
        }
      ]
    },
    {
      "name": "CSS",
      "id": "css",
      "description": "The code that styles HTML: dictates look, layout, and general presentation. Once you've laid out your content using HTML, use CSS to make it look good.",
      "resources": [
        {
          "name": "HTML Dog",
          "url": "http://www.htmldog.com/guides/css",
          "description": "HTML dog will walk you through learning a lot of the most important CSS properties. They have beginner, intermediate, and advanced tracks."
        },
        {
          "name": "Mozilla Developer Network",
          "url": "https://developer.mozilla.org/en-US/docs/Web/HTML",
          "description": "Extensive reference by the organization behind Firefox. If you need any property of CSS explained to you very clearly or in detail, look here."
        },
        {
          "name": "Codecademy Web Fundamentals Track",
          "url": "http://www.codecademy.com/tracks/web",
          "description": "Interactive, online tutorial to learn to HTML and CSS. No experience necessary, and great for learning HTML and CSS together."
        }
      ]
    },
    {
      "name": "CSS Preprocessors",
      "id": "css-preprocessors",
      "description": "Once you've got the hang of CSS, CSS preprocessors allow you to write CSS using more powerful features, such as variables, functions, and “mixins.” After development, these files get compiled into regular CSS that all web browsers can understand. Makes CSS easier.",
      "resources": [
        {
          "name": "Sass",
          "url": "http://sass-lang.com",
          "description": "Sass makes CSS fun again. Sass is an extension of CSS3, adding nested rules, variables, mixins, selector inheritance, and more. It’s translated to well-formatted, standard CSS using the command line tool or a web-framework plugin."
        },
        {
          "name": "LESS",
          "url": "http://lesscss.org",
          "description": "The dynamic stylesheet language. LESS extends CSS with dynamic behavior such as variables, mixins, operations and functions."
        },
        {
          "name": "Stylus",
          "url": "http://learnboost.github.io/stylus",
          "description": "Stylus is a revolutionary new language, providing an efficient, dynamic, and expressive way to generate CSS. Supporting both an indented syntax and regular CSS style."
        },
        {
          "name": "CSS Preprocessor Shootout",
          "url": "http://net.tutsplus.com/tutorials/html-css-techniques/sass-vs-less-vs-stylus-a-preprocessor-shootout",
          "description": "Side-by-side comparison of Sass, LESS, and Stylus. Check here if you want to see the differences."
        }
      ]
    },
    {
      "name": "JavaScript",
      "id": "javascript",
      "description": "The programming language of the web. If you want your web site/app to move, change, or communicate, learn JavaScript.",
      "resources": [
        {
          "name": "Eloquent JavaScript",
          "url": "http://eloquentjavascript.net/contents.html",
          "description": "Eloquent JavaScript is designed for people without any programming experience, and will teach you how to program while also teaching you the ins and outs of JavaScript."
        },
        {
          "name": "Codecademy JavaScript Track",
          "url": "http://www.codecademy.com/tracks/javascript",
          "description": "Interactive, online tutorial to learn to JavaScript. Best taken after Codecademy's Web Fundamentals track."
        },
        {
          "name": "codeschool JavaScript Road Trip",
          "url": "https://www.codeschool.com/courses/javascript-road-trip-part-1",
          "description": "An introduction to the very basics of the JavaScript language. Build a foundation of JavaScript syntax and learn how to use values, variables, and files."
        },
        {
          "name": "LearnStreet beginner course on JavaScript",
          "url": "https://www.learnstreet.com/lessons/study/javascript",
          "description": "In this course, you'll learn how to code in JS, a flexible and powerful programming language used all over the web."
        },
        {
          "name": "Airbnb JavaScript Style Guide",
          "url": "https://github.com/airbnb/javascript",
          "description": "This page is Airbnb's JavaScript style guide, and is a great reference for writing quality JavaScript code.  They include suggestions for spacing, variable declarations, and pretty much everything else JavaScript."
        },
        {
          "name": "Intro to JavaScript",
          "url": "https://docs.google.com/presentation/d/1-3ctZ2obbnF09CBcc2Q70cSUrwk08HT7zDGHSG3qqR8/edit?usp=sharing",
          "description": "Written and developed by Gilad Penn, covering syntax, Document Object Model manipulation, and a bit of jQuery.",
          "adi": true
        }
      ]
    },
    {
      "name": "jQuery",
      "id": "jquery",
      "description": "A popular (used on more than half of the 10,000 most popular websites) JavaScript library that greatly simplifies client-side scripting. Write less, do more. If you use JavaScript, jQuery will give you cool features and make your life easier.",
      "resources": [
        {
          "name": "jQuery",
          "url": "http://www.jquery.com",
          "description": "The documentation on the jQuery official site is superb, and is a great way of getting started learning."
        },
        {
          "name": "30 Days to Learn jQuery",
          "url": "https://tutsplus.com/course/30-days-to-learn-jquery",
          "description": "A video series which emails you a video once a day for 30 days in order to provide step-by-step instruction in learning to use jQuery."
        },
        {
          "name": "Unheap",
          "url": "http://www.unheap.com",
          "description": "Unheap is an aggregation of open-source jQuery plugins (meaning they’re free to use!), which allow you to do some amazing things like animated image galleries and scroll to refresh."
        },
        {
          "name": "Codecademy jQuery Track",
          "url": "http://www.codecademy.com/tracks/jquery",
          "description": "Interactive, online tutorial to learn to jQuery. Best after taking the Javascript track."
        },
        {
          "name": "Try jQuery",
          "url": "http://try.jquery.com",
          "description": "A combination of videos, interactive console challenges, and writing code in the browser. You'll need about 3 hours of time to make it through everything."
        }
      ]
    },
    {
      "name": "Bootstrap",
      "id": "bootstrap",
      "description": "Twitter's front-end UI framework which packages up a bunch of useful CSS and JavaScript tools. Great for making web sites that look pretty good (if a little generic) quickly. It's \"responsive\", so your site will look good on screens of all sizes (desktop, tablet, mobile).",
      "resources": [
        {
          "name": "Bootstrap",
          "url": "http://getbootstrap.com",
          "description": "Download and learn Bootstrap. See especially the \"Getting started\" page, and check out some examples."
        },
        {
          "name": "Bootstrap Magic",
          "url": "http://pikock.github.io/bootstrap-magic/index.html",
          "description": "Easily create a Bootstrap theme."
        },
        {
          "name": "1pxdeep",
          "url": "http://rriepe.github.io/1pxdeep",
          "description": "Flat-ish version of Bootstrap."
        },
        {
          "name": "Flatstrap",
          "url": "http://flatstrap.org",
          "description": "Another flat version of Bootstrap. Looks similar, but with gradients and shadows gone. Also check out the \"flatstrap-sass\" and \"flatstrap-rails\" Ruby gems (easy to find on Google) for painless integraiton with Ruby on Rails (if you don't know what Rails is, disregard that last bit)."
        }
      ]
    },
    {
      "name": "Foundation",
      "id": "foundation",
      "description": "A front-end UI framework similar to Bootstrap. Looks a little different. Great for getting a site up and running quickly. It's \"responsive\", so your site will look good on screens of all sizes (desktop, tablet, mobile).",
      "resources": [
        {
          "name": "Foundation",
          "url": "http://foundation.zurb.com",
          "description": "Download and learn Foundation. See especially the \"Docs\" page."
        }
      ]
    },
    {
      "name": "AngularJS",
      "id": "angularjs",
      "description": "A front-end framework for building maintainable one-page applications. Lets you \"extend\" HTML for dynamic applications. If you have enough JavaScript going on that things are starting to get complicated, look into Angular.",
      "resources": [
        {
          "name": "Introduction to AngularJS",
          "url": "http://www.webdesignerdepot.com/2013/04/an-introduction-to-angularjs",
          "description": "Post about the capabilities and usage of angular. Good overview of why you might want to use it."
        },
        {
          "name": "AngularJS Guide",
          "url": "http://docs.angularjs.org/guide",
          "description": "Official documentation from the AngularJS team. A great starting point."
        },
        {
          "name": "Angular Seed",
          "url": "https://github.com/angular/angular-seed",
          "description": "A small skeleton AngularJS app."
        },
        {
          "name": "AngularJS Learning",
          "url": "https://github.com/jmcunningham/AngularJS-Learning",
          "description": "A bunch of links to blog posts, articles, videos, etc. for learning AngularJS."
        }
      ]
    },
    {
      "name": "Meteor",
      "id": "meteor",
      "description": "Meteor allows you to program in Javascript on the client and on the server. Have all of your users be in sync automatically!",
      "resources": [
        {
          "name": "Intro to Meteor.js",
          "url": "https://speakerdeck.com/brishin/intro-to-meteor-dot-js",
          "description": "Given by ADI's Brian Shin, this talk goes into the basics and explains why your next app should be built in Meteor!",
          "adi": true
        },
        {
          "name": "Best Learning Resources for Meteor.js",
          "url": "https://www.yauh.de/articles/376/best-learning-resources-for-meteorjs/",
          "description": "This blog post collects all of the resources, tutorials, and code samples for learning JavaScript and Meteor."
        }
      ]
    },
    {
      "name": "Backbone.js",
      "id": "backbone-js",
      "description": "An MVC framework for frontend JavaScript. Backbone.js gives structure to web applications. If you have enough JavaScript going on that things are starting to get complicated, look into Backbone. ",
      "resources": [
        {
          "name": "Backbone.js",
          "url": "http://backbonejs.org",
          "description": "Backbone home page."
        }
      ]
    },
    {
      "name": "CoffeeScript",
      "id": "coffeescript",
      "description": "A frontend language meant to solve the various problems/warts in JavaScript. Syntax inspired by Ruby. If you don't like JavaScript syntax but want to code for the browser, check out CoffeeScript.",
      "resources": [
        {
          "name": "CoffeeScript",
          "url": "http://www.coffeescript.org",
          "description": "CoffeeScript homepage. Side-by-side comparison with JavaScript."
        }
      ]
    },
    {
      "name": "Python",
      "id": "python",
      "description": "A general-purpose, high-level programming language focused on clarity and readability. Often used to write the backend for web applications. A great first programming language.",
      "resources": [
        {
          "name": "Learn Python the Hard Way",
          "url": "http://learnpythonthehardway.org",
          "description": "Learn Python the Hard Way is a book (available for free here) for people who do not have experience programming, and it will teach you to program while teaching you Python."
        },
        {
          "name": "Codecademy Python Track",
          "url": "http://www.codecademy.com/tracks/python",
          "description": "Interactive, online tutorial to learn to program Python. No experience necessary."
        },
        {
          "name": "Dive into Python",
          "url": "http://www.diveintopython.net",
          "description": "Dive into Python is a book about Python for people who already know how to program in another language."
        },
        {
          "name": "LearnStreet beginner course on Python",
          "url": "https://www.learnstreet.com/lessons/study/python",
          "description": "Online intro to Python 2.7. Will teach you the key concepts in Python. No experience necessary."
        },
        {
          "name": "An Introduction to Python Programming",
          "url": "http://adicu.github.com/intro-webdev/python/",
          "description": "Written and developed by ADI, this tutorial covers basics of programming in Python.",
          "adi": true
        }
      ]
    },
    {
      "name": "Flask",
      "id": "flask",
      "description": "A simple and lightweight web framework for Python that allows you to quickly develop web applications. This is the easiest way to get going with a simple web app. If you want to extend your web site to have changing, dynamic content, Flask is a great place to start.",
      "resources": [
        {
          "name": "Flask",
          "url": "http://flask.pocoo.org",
          "description": "The Flask homepage. Gives a quick introduction, and the docs are really good."
        },
        {
          "name": "The Flask Mega-Tutorial",
          "url": "http://blog.miguelgrinberg.com/post/the-flask-mega-tutorial-part-i-hello-world",
          "description": "An 18-part tutorial that starts from Hello World and takes you to an advanced Flask app.  Assumes some knowledge of Python."
        },
        {
          "name": "An Accelerated Introduction to Web Development",
          "url": "http://adicu.github.com/intro-webdev",
          "description": "Written and developed by ADI, this 5-part tutorial covers basic Python, Flask, HTML, CSS, and API programming.",
          "adi": true
        }
      ]
    },
    {
      "name": "Django",
      "id": "django",
      "description": "A one-stop MVC web framework for Python that brings together all the bits you need to develop a web application. It's a lot heavier than Flask, but might be better for more complicated apps.",
      "resources": [
        {
          "name": "Django",
          "url": "https://www.djangoproject.com",
          "description": "The Django homepage. Has more information "
        }
      ]
    },
    {
      "name": "Ruby",
      "id": "ruby",
      "description": "A general-purpose, high-level programming language focused on clarity and readability. Often used to write the backend for web applications. Similar to Python, but most people prefer one to the other (ADI right now uses more Python).",
      "resources": [
        {
          "name": "Codecademy Ruby Track",
          "url": "http://www.codecademy.com/tracks/ruby",
          "description": "Interactive, online tutorial to learn to program Ruby. No experience necessary."
        },
        {
          "name": "Why's (Poignant) Guide to Ruby",
          "url": "http://mislav.uniqpath.com/poignant-guide",
          "description": "Part tutorial, part comic book, part really bizarre art, Why's (Poignant) Guide to Ruby is considered a classic way to learn the language."
        },
        {
          "name": "Code School Ruby",
          "url": "https://www.codeschool.com/courses/try-ruby",
          "description": "Learn the basic building blocks of Ruby, all in the browser."
        },
        {
          "name": "Ruby User's Guide",
          "url": "http://www.rubyist.net/~slagell/ruby",
          "description": "Another, more traditional way to learn Ruby. Try this if Why's isn't your style."
        },
        {
          "name": "Official Ruby Documentation",
          "url": "https://www.ruby-lang.org/en",
          "description": "Official source of information about the Ruby language."
        },
        {
          "name": "Mr. Neighborly's Humble Little Ruby Book",
          "url": "http://www.humblelittlerubybook.com",
          "description": "From the website: \"An up to date book on Ruby programming, written in a style described as 'a beautiful display of pragmatically chunky bacon, wrapped in a nutshell.' Or something like that.\""
        },
        {
          "name": "LearnStreet Ruby for Beginners V3",
          "url": "https://www.learnstreet.com/lessons/study/ruby",
          "description": "In this course, you'll learn how to code in Ruby, a flexible yet powerful programming language that’s popular over the web."
        }
      ]
    },
    {
      "name": "Ruby on Rails",
      "id": "ruby-on-rails",
      "description": "Ruby on Rails is a model-view-controller framework for building web applications with Ruby. As such, it touches all parts of the stack, from running a web server to rendering front-end templates. A really popular framework for web apps.",
      "resources": [
        {
          "name": "Official Ruby on Rails Tutorial",
          "url": "http://ruby.railstutorial.org/ruby-on-rails-tutorial-book",
          "description": "This tutorial will walk you through building your first app with Ruby on Rails."
        },
        {
          "name": "Rails Tutorials, Examples, and Starter Applications",
          "url": "http://railsapps.github.io/rails-examples-tutorials.html",
          "description": "A compilation of starter applications, tutorials, templates, and examples for different Rails libraries."
        },
        {
          "name": "Code School Rails for Zombies",
          "url": "https://www.codeschool.com/courses/rails-for-zombies-redux",
          "description": "Learn Ruby on Rails, an open-source framework for the Ruby programming language. Rails for Zombies will teach you all the Rails basics with a zombie flair."
        }
      ]
    },
    {
      "name": "Sinatra",
      "id": "sinatra",
      "description": "A simple Ruby web framework, lighter than Ruby on Rails. Flask is inspired by this, so they're good analogues.",
      "resources": [
        {
          "name": "Sinatra",
          "url": "http://www.sinatrarb.com",
          "description": "Official Sinatra homepage. Get started here."
        }
      ]
    },
    {
      "name": "Git",
      "id": "git",
      "description": "Git is a Version Control System (VCS), which lets you track changes to code over time and collaborate with others. A VCS is critical to working on any medium-to-large application, and really helpful when working on a project with someone else.",
      "resources": [
        {
          "name": "Try Git",
          "url": "http://try.github.io",
          "description": "A really awesome in-browser tutorial/game that lets you get a feel for what git is like, interactively."
        },
        {
          "name": "Pro Git",
          "url": "http://git-scm.com/book",
          "description": "Pro Git, available freely on the git website, is an excellent book covering all aspects of git, including use and inner workings. A must-read to fully understand git."
        },
        {
          "name": "GitHub",
          "url": "http://www.github.com",
          "description": "GitHub is a website that hosts git repositories. It lets you store a shared copy of code that you're working on with someone else, as well as see others' code and contribute to open source projects."
        }
      ]
    },
    {
      "name": "Storage (databases)",
      "id": "databases",
      "description": "If you want to save information when a user leaves your app or coordinate between different users, you need a database of some sort. Here are some good options to get started.",
      "resources": [
        {
          "name": "SQLite",
          "url": "http://sqlite.org/quickstart.html",
          "description": "A \"relational\" database-think about it like an Excel spreadsheet, but stricter, bigger, and more powerful. It might already be installed and it's really easy to set up a database. Note that you'll need to learn the basics of Structured Query Language (SQL) in order to use it."
        },
        {
          "name": "MongoDB",
          "url": "http://try.mongodb.org",
          "description": "A \"non-relational\" database. You put whole \"objects\" in and can query them in simple or complicated ways. Check out the interactive dmeo!"
        },
        {
          "name": "MariaDB (MySQL)",
          "url": "https://mariadb.org",
          "description": "Another \"relational\" database. This one is very popular, and also powerful. You need to know SQL for this. MariaDB is based on MySQL, and was forked after the community worried that Oracle wasn't devoting enough time to the project and was hiding things; they're mostly identical, but MariaDB is the way to go for \"MySQL\" nowadays."
        }
      ]
    },
    {
      "name": "Hosting",
      "id": "hosting",
      "description": "In order for your project to be out on the internet, you need to get it hosted. Here are a bunch of options to do that.",
      "resources": [
        {
          "name": "Neocities",
          "url": "https://neocities.org",
          "description": "This site was created to let beginners host websites with static content. Start here if you're just trying to get a web page online!"
        },
        {
          "name": "GitHub Pages",
          "url": "http://pages.github.com",
          "description": "If you're using GitHub, this is a really easy way to publish a project page."
        },
        {
          "name": "Parse",
          "url": "http://www.parse.com",
          "description": "Parse is a cloud app platform with free tiers. Great place to host apps."
        },
        {
          "name": "Heroku",
          "url": "http://www.heroku.com",
          "description": "Heroku is a Platform as a Service (PaaS) provider, which means that they host your apps for you without you having to manage any computers, virtual or otherwise."
        },
        {
          "name": "Amazon Web Services",
          "url": "http://aws.amazon.com",
          "description": "Amazon Web Services (AWS) is a cloud hosting provider that has a bunch of cloud options, the easiest of which is Elastic Cloud Compute (EC2). EC2 just gives you a virtual machine in one of their data centers that you control completely, so it's a very flexible option."
        }
      ]
    },
    {
      "name": "Java",
      "id": "java",
      "description": "Java is an object oriented language, and the most widely used language in the world. It is compiled down to Java byte code, and then run on a Java Virtual Machine. Because JVMs have been made for many different platforms, people often say of Java, \"Write once, run anywhere.\". Java is great language if you want to program for Android or program scalable systems (both big and small companies use Java, but it's not a usual choice for prototyping). We'll probably have a hard time teaching you Java online, so these resources are more advanced.",
      "resources": [
        {
          "name": "Effective Java",
          "url": "http://www.amazon.com/Effective-Java-Edition-Joshua-Bloch/dp/0321356683",
          "description": "Assumes you already know Java, and teaches you how to write really good Java."
        },
        {
          "name": "Java Concurrency in Practice",
          "url": "http://www.amazon.com/Java-Concurrency-Practice-Brian-Goetz/dp/0321349601",
          "description": "Java has a battlehardened concurrency library that is very basic and widely imitated. This is the standard book on Java concurrency."
        }
      ]
    },
    {
      "name": "Android",
      "id": "android",
      "description": "The Android SDK is the library that lets you write programs that run on Android.",
      "resources": [
        {
          "name": "Intro to Android by ADI",
          "url": "https://github.com/parthibanloganathan/android-tutorial",
          "description": "If you want to learn Android, ADI's got your back. We have an introductory Android tutorial to help you make a fully functional Android app in a matter of hours.",
          "adi": true
        },
        {
          "name": "Android Developer Reference",
          "url": "https://developer.android.com/develop/index.html",
          "description": "Portal for all things Android development: references, tools, news."
        },
        {
          "name": "Vogella",
          "url": "http://www.vogella.com/tutorials/android.html",
          "description": "Detailed Android development tutorials covering almost everything you would want to know"
        },
        {
          "name": "Programming Mobile Applications for Android Handheld Systems",
          "url": "https://www.coursera.org/course/android",
          "description": "Coursera class to use if you want to learn Android more formally"
        },
        {
          "name": "Mobile Cloud Computing with Android",
          "url": "https://www.coursera.org/specialization/mobilecloudcomputing/2",
          "description": "Coursera specialization to become an Android pro"
        }
      ]
    },
    {
      "name": "Scala",
      "id": "scala",
      "description": "A powerful and flexible programming language, useful for tackling hard problems.",
      "resources": [
        {
          "name": "Try Scala",
          "url": "http://www.tryscala.com",
          "description": "An interactive Scala demo. Try it out and try not to get hooked."
        },
        {
          "name": "Scala School",
          "url": "http://twitter.github.io/scala_school",
          "description": "How Twitter ramps up their engineers (with Java experience) on Scala."
        },
        {
          "name": "Functional Programming Principles in Scala",
          "url": "https://www.coursera.org/course/progfun",
          "description": "Take a Coursera class from Martin Odersky, the creator of Scala himself"
        },
        {
          "name": "Programming in Scala",
          "url": "http://www.amazon.com/Programming-Scala-Comprehensive-Step-Step/dp/0981531644",
          "description": "Written by Martin Odersky, this is the definitive guide to the language."
        },
        {
          "name": "Effective Scala",
          "url": "http://twitter.github.io/effectivescala",
          "description": "Twitter Scala style guide."
        }
      ]
    },
    {
      "name": "Objective-C",
      "id": "objective-c",
      "description": "A superset of C, Objective-C is the language that iOS and Mac apps are written in.",
      "resources": [
        {
          "name": "codeschool Try Objective-C ",
          "url": "https://www.codeschool.com/courses/try-objective-c",
          "description": "Learn the language that powers iOS and Mac apps.  In this course, you'll learn the fundamental building blocks of Objective-C and explore the foundation of elegant and beautiful apps."
        },

        {
          "name": "Big Nerd Ranch Objective-C Programming Guide",
          "url": "http://www.bignerdranch.com/book/objective-c_programming_the_big_nerd_ranch_guide",
          "description": "A great book that walks beginners through the basics of Objective-C.  A great buy."
        },
        {
          "name": "NSHipster",
          "url": "http://nshipster.com",
          "description": "NSHipster is a blog that has great explanations for some of the quirks and \"overlooked bits\" of Objective-C and Cocoa."
        }
      ]
    },
    {
      "name": "iOS",
      "id": "ios",
      "description": "Learn to build an iOS application by learning to code in Objective-C.",
      "resources": [
        {
          "name": "Big Nerd Ranch iOS Programming Guide",
          "url": "http://www.bignerdranch.com/book/ios_programming_the_big_nerd_ranch_guide_rd_edition_",
          "description": "A great book that walks beginners through the basics of iOS.  Best after the Big Nerd Ranch Objective-C book."
        },
        {
          "name": "NSHipster",
          "url": "http://nshipster.com",
          "description": "NSHipster is a blog that has great explanations for some of the quirks and \"overlooked bits\" of Objective-C and Cocoa."
        }
      ]
    }
  ],
  "tracks": [
    {
      "name": "Web Site (beginner)",
      "description": "This is the most basic track, best for beginners who are looking to build their first website.",
      "topics": ["html", "css", "hosting"]
    },
    {
      "name": "Web Site (advanced)",
      "description": "For a professional looking personal page or web site.",
      "topics": ["html", "css", "hosting", "javascript", "jquery", "bootstrap", "foundation"]
    },
    {
      "name": "Web App",
      "description": "For building a dynamic web application.  Adding Python and Flask to traditional web technologies allows for creating user accounts and/or storing data in a database.",
      "topics": ["python", "flask", "html", "css", "javascript", "hosting", "git"]
    },
    {
      "name": "Android",
      "description": "Learn to build an app on Google's mobile operating system.",
      "topics": ["java", "android"]
    },
    {
      "name": "iOS",
      "description": "Build a app for iPhone and iPad.",
      "topics": ["objective-c", "ios"]
    }
  ]
}
